// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//

// let x = 0;
//
// if (x !=== 0) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину годин

// let time = +prompt('числу від 0 до 59');
//
// if (time >= 0 && time <= 14) {
//     document.write('перша чверть')
// } else if (time >= 15 && time <= 29) {
//     document.write('друга чверть')
// } else if (time >= 30 && time <= 44) {
//     document.write('трет чверть')
// } else if (time >= 45 && time <= 59) {
//     document.write('четверта чверть')
// } else {
//     document.write('Ви ввели не вірий час')
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//

// let day = +prompt('');
//
// if (day >=1 && day <= 10) {
//     console.log('перша декада');
// } else if (day >=11 && day <= 20) {
//     console.log('друга декада');
// } else if (day >=21 && day <= 31) {
//     console.log('третя декада');
// } else {
//     console.log('не вірно вказаний день');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).


// let dayNum = +prompt('Введіть номер дня тижня');
//
// switch (dayNum) {
//     case 1:
//         document.write(
//             '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '20:00 - Практика' + `<br/>` +
//             '22:00 - Сон'
//         )
//         break;
//     case 2:
//         document.write(
//             '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '19:30 -  Лекція' + `<br/>` +
//             '22:00 - Сон');
//         break;
//     case 3:
//         document.write(
//             '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '20:00 - Практика' + `<br/>` +
//             '22:00 - Сон'
//         );
//         break;
//     case 4:
//         document.write(  '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '19:30 -  Лекція' + `<br/>` +
//             '22:00 - Сон');
//         break;
//     case 5:
//         document.write(  '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '19:00 - Навчання' + `<br/>` +
//             '22:00 - Сон');
//         break;
//     case 6:
//         document.write(
//             '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '19:00 - Навчання' + `<br/>` +
//             '22:00 - Сон'
//         );
//         break;
//     case 7:
//         document.write(
//             '6:00 - Ранкова пробіжка та тренування' + `<br/>` +
//             '7:00 - Плавання' + `<br/>` +
//             '8:00 - Навчання' + `<br/>` +
//             '9:00 - Сніданок' + `<br/>` +
//             '9:30 - Навчання' + `<br/>` +
//             '13:00 - Обід' + `<br/>` +
//             '14:00 - Навчання' + `<br/>` +
//             '18:00 - вечеря' + `<br/>` +
//             '19:00 - Навчання' + `<br/>` +
//             '22:00 - Сон'
//         );
//         break;
//     default:
//         document.write('Ви ввели не вірний день тижня');
// }


//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

// let num1 = +prompt('Number one');
// let num2 = +prompt('Number two');
//
// if (num1 > num2) {
//     document.write(num1);
// } else if (num2 > num1) {
//     document.write(num2);
// } else if (num1 === num2) {
//     document.write('Числа рівні між собою');
// } else {
//     document.write('Ви ввели не тект, будьте уважними!')
// }


//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy
//         (хибноподыбне, тобто кастується до false)

let x = +prompt('???');

if (x === '' || x === 0 || x === undefined || x === null || isNaN(x)) {
    x = 'default';
    console.log(x)
} else {
    console.log(x)
}

